doc/src/reg_example.org
#+TITLE:     ClojureGP: Experiment example
#+AUTHOR:    Stefan van der Meer
#+EMAIL:     stefanvandermeerREMOVE@THISgmail.com
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:3 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_FILE_NAME: ../reg_example.html
#+LINK_UP:   
#+LINK_HOME: 
#+STYLE: <link rel="stylesheet" type="text/css" href="docstyle.css" />
#+STYLE: <style type="text/css">
#+STYLE: .outline-2 { border: 1px solid #EEE; margin-bottom: 0.2em; }
#+STYLE: .outline-3 { padding-left: 1em; }
#+STYLE: .outline-3 p { margin-top: 0.5em; padding-left: 0.25em; }
#+STYLE: h2 { margin-top: 0; padding: 0.1em; background: #CEF;
#+STYLE:    }
#+STYLE: h3 { font-size: 10pt; margin-bottom: 1pt; }
#+STYLE: </style>

In this document we will walk through the construction of the regression
example, available in */examples/reg\_exp.clj*. Some familiarity with Clojure
(or any other Lisp) is assumed. You should also read the [[./overview.html][Overview]] article if you
have not done so yet.

* Building a simple regression experiment
** Preparations
Create a *.clj* file with an appropriate name, like
*reg\_exp.clj*. Alternatively, open */examples/reg\_exp.clj* as included in the
ClojureGP package and follow along there.

It's good practice to keep an experiment in its own namespace, but this is not a
technical requirement. Still, for this tutorial, let's do it properly:
#+BEGIN_SRC clojure
(ns reg-exp
  (:use [cljgp.core :only [generate-run]]
	[cljgp.config :only [prim, make-func-template]]
	[cljgp.random :only [gp-rand]]
	[cljgp.util :only [tree-depth]]
	[cljgp.tools.logging :only [print-stats, reduce-to-summary]]))
#+END_SRC

We will be using a few functions provided by ClojureGP, referenced explicitly
here for clarity. Besides the core function that will generate our GP run, we
grab two functions that will help in creating our experiment configuration from
=cljgp.config=. As our evaluation will use random values, we need
=cljgp.random/gp-rand=. Then there's =tree-depth=, which we will use in a tree
validator function that will limit the size of the evolved expression
trees. Lastly, two logging functions that will generate some useful output.

** Define an evaluation function
We will need to define a evaluation function that compares the results of an
evolved function to the target results. In context of the regression problem,
this involves computing the expected result of the target equation given certain
values of the variables involved. This target result then needs to be compared
to the result of applying the evolved function with the same values.

For this example we will use a simple target equation:
~z = x^2 * y^2 + x^4 + x * y~

The following function evaluates a given evolved function on a single random =x,
y= instance.
#+BEGIN_SRC clojure
(defn test-reg-once
  "Evaluate the given function on a single result, returning the abs error."
  [func]
  (let [x (gp-rand)
	y (gp-rand)
	target (+ 
		(+ (* (* x x) (* y y)) (* (* x x) (* x x)))
		(* x y))		; z = x^2 * y^2 + x^4 + xy
    	result (func x y)]
    (Math/abs (float (- target result)))))
#+END_SRC
First we use =gp-rand= to generate our random =x= and =y=. It is important to
use =gp-rand=, as it will be bound at runtime to a function that uses the
correct, thread-local, seeded RNG. This allows us to reproduce results and avoid
bottlenecking multi-threaded performance on a single synchronised RNG.

Then we compute the target value given those =x= and =y=, and the result the
evolved function produces for the same values. Because the given evolved =func=
is a proper Clojure function, we can simply apply it with =x= and =y= as its
arguments. We will set up our experiment configuration for this later on in this
tutorial.

Lastly, the absolute error is returned, as a convenient measure of the quality
of the result.

Evaluating on a single random instance is a bit unreliable, so we will
instead sum the result of a number of such tests, for our final evaluation function:
#+BEGIN_SRC clojure
(defn evaluate-reg
  "Evaluate the given function on multiple results and return a fitness."
  [func]
  (reduce + (take 10 (repeatedly #(test-reg-once func)))))
#+END_SRC

We simply repeatedly apply =test-reg-once= to the evolved function and sum the
errors. If all results are identical to the target, the total error will be 0,
which equates to a perfect fitness. Larger errors mean higher and therefore
worse fitness.

