doc/reg_example.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>ClojureGP: Experiment example</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-02-18 19:33:42 "/>
<meta name="author" content="Stefan van der Meer"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="docstyle.css" />



</head>
<body>
<div id="content">

<h1 class="title">ClojureGP: Experiment example</h1>

<p>In this document we will walk through the construction of the regression
example, available in <b>/examples/reg_exp.clj</b>. Some familiarity with Clojure
(or any other Lisp) is assumed. You should also read the <a href="./overview.html">Overview</a> article if you
have not done so yet.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Building a simple regression experiment </a>
<ul>
<li><a href="#sec-1_1">1.1 Preparations </a></li>
<li><a href="#sec-1_2">1.2 Define an evaluation function </a></li>
<li><a href="#sec-1_3">1.3 Define a type hierarchy </a></li>
<li><a href="#sec-1_4">1.4 Define an experiment configuration </a>
<ul>
<li><a href="#sec-1_4_1">1.4.1 Function set and terminal set </a></li>
<li><a href="#sec-1_4_2">1.4.2 The other bits </a></li>
<li><a href="#sec-1_4_3">1.4.3 Final configuration </a></li>
</ul>
</li>
<li><a href="#sec-1_5">1.5 Run the experiment </a>
<ul>
<li><a href="#sec-1_5_1">1.5.1 Run function </a></li>
<li><a href="#sec-1_5_2">1.5.2 Performing a run </a></li>
</ul>
</li>
<li><a href="#sec-1_6">1.6 In conclusion </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Building a simple regression experiment </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> Preparations </h3>
<div class="outline-text-3" id="text-1_1">

<p>Create a <b>.clj</b> file with an appropriate name, like
<b>reg_exp.clj</b>. Alternatively, open <b>/examples/reg_exp.clj</b> as included in the
ClojureGP package and follow along there.
</p>
<p>
It's good practice to keep an experiment in its own namespace, but this is not a
technical requirement. Still, for this tutorial, let's do it properly:
</p>


<pre class="src src-clojure">(<span style="color: #4477FF; font-weight: bold;">ns</span> reg-exp
  (<span style="color: #AABBFF;">:use</span> [cljgp.core <span style="color: #AABBFF;">:only</span> [generate-run]]
    [cljgp.config <span style="color: #AABBFF;">:only</span> [prim, make-func-template]]
    [cljgp.random <span style="color: #AABBFF;">:only</span> [gp-rand]]
    [cljgp.util <span style="color: #AABBFF;">:only</span> [tree-depth]]
    [cljgp.tools.logging <span style="color: #AABBFF;">:only</span> [print-stats, reduce-to-summary]]))
</pre>



<p>
We will be using a few functions provided by ClojureGP, referenced explicitly
here for clarity. Besides the core function that will generate our GP run, we
grab two functions that will help in creating our experiment configuration from
<code>cljgp.config</code>. As our evaluation will use random values, we need
<code>cljgp.random/gp-rand</code>. Then there's <code>tree-depth</code>, which we will use in a tree
validator function that will limit the size of the evolved expression
trees. Lastly, two logging functions that will generate some useful output.
</p>
</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> Define an evaluation function </h3>
<div class="outline-text-3" id="text-1_2">

<p>We will need to define a evaluation function that compares the results of an
evolved function to the target results. In context of the regression problem,
this involves computing the expected result of the target equation given certain
values of the variables involved. This target result then needs to be compared
to the result of applying the evolved function with the same values.
</p>
<p>
For this example we will use a simple target equation:
<code>z = x^2 * y^2 + x^4 + x * y</code>
</p>
<p>
The following function evaluates a given evolved function on a single random <code>x, y</code> instance.
</p>


<pre class="src src-clojure">(<span style="color: #4477FF; font-weight: bold;">defn</span> <span style="color: #BB3344;">test-reg-once</span>
  <span style="color: #AA44AA; background-color: #231323;">"Evaluate the given function on a single result, returning the abs error."</span>
  [func]
  (<span style="color: #4477FF; font-weight: bold;">let</span> [x (gp-rand)
    y (gp-rand)
    target (<span style="color: #AABBFF;">+</span> 
        (<span style="color: #AABBFF;">+</span> (<span style="color: #AABBFF;">*</span> (<span style="color: #AABBFF;">*</span> x x) (<span style="color: #AABBFF;">*</span> y y)) (<span style="color: #AABBFF;">*</span> (<span style="color: #AABBFF;">*</span> x x) (<span style="color: #AABBFF;">*</span> x x)))
        (<span style="color: #AABBFF;">*</span> x y))        <span style="color: #119933; background-color: #132313;">; </span><span style="color: #119933; background-color: #132313;">z = x^2 * y^2 + x^4 + xy
</span>        result (func x y)]
    (<span style="color: #AABBFF;">Math/abs</span> (<span style="color: #AABBFF;">float</span> (<span style="color: #AABBFF;">-</span> target result)))))
</pre>


<p>
First we use <code>gp-rand</code> to generate our random <code>x</code> and <code>y</code>. It is important to
use <code>gp-rand</code>, as it will be bound at runtime to a function that uses the
correct, thread-local, seeded RNG. This allows us to reproduce results and avoid
bottlenecking multi-threaded performance on a single synchronised RNG.
</p>
<p>
Then we compute the target value given those <code>x</code> and <code>y</code>, and the result the
evolved function produces for the same values. Because the given evolved <code>func</code>
is a proper Clojure function, we can simply apply it with <code>x</code> and <code>y</code> as its
arguments. We will set up our experiment configuration for this later on in this
tutorial.
</p>
<p>
Lastly, the absolute error is returned, as a convenient measure of the quality
of the result.
</p>
<p>
Evaluating on a single random instance is a bit unreliable, so we will
instead sum the result of a number of such tests, for our final evaluation function:
</p>


<pre class="src src-clojure">(<span style="color: #4477FF; font-weight: bold;">defn</span> <span style="color: #BB3344;">evaluate-reg</span>
  <span style="color: #AA44AA; background-color: #231323;">"Evaluate the given function on multiple results and return a fitness."</span>
  [func]
  (<span style="color: #AABBFF;">reduce</span> + (<span style="color: #AABBFF;">take</span> 10 (<span style="color: #AABBFF;">repeatedly</span> #(test-reg-once func)))))
</pre>



<p>
We simply repeatedly apply <code>test-reg-once</code> to the evolved function and sum the
errors. If all results are identical to the target, the total error will be 0,
which equates to a perfect fitness. Larger errors mean higher and therefore
worse fitness.
</p>
</div>

</div>
