doc/src/reg_example.org
** Define a type hierarchy
At this point we would normally consider what types of values are playing a role
in the experiment, and use Clojure's ad hoc hierarchies with =derive= to create
an appropriate type hierarchy.

For this experiment however, we are evolving an equation, which only involves a
bunch of numbers. All function and terminal nodes will be of the same type,
which makes the experiment as a whole essentially untyped.

With some creativity we can still take a look at deriving type hierarchies:
#+BEGIN_SRC clojure
(derive ::number ::any)
(derive ::string ::any)
(derive Number ::number)
#+END_SRC

We pick =::any= as our root type here. This is arbitrary, as Clojure hierarchies
are very free-form, and let you use any keyword you want. We =derive= the
=::number= keyword from =::any=. This means we can define a function in our
experiment configuration's function set that requires an argument of type
=::any=, meaning the GP process can use any other node that has either the type
=::any=, or the type =::number=, because =(isa? ::number ::any)= is true.

Then we also derive =::string= from =::any=, meaning =(isa? ::string ::any)=
will be true, and for the hypothetical function mentioned just now any node of
type =::any=, =::number= or =::string= could be used.

Lastly we derive =Number=, that is the class =java.lang.Number=, from
=::any=. Java classes can (only) form the leaves in a Clojure hierarchy, and can
be used as types in ClojureGP experiments. Any Java subclasses will behave
properly, i.e. =(isa? Float Number)= is true, which is something you can also
employ in defining your types. In practice however, it's often nice to just
define a custom keyword hierarchy, as it is much easier to reorganise.

In this experiment, we will just define every type as being =Number=.

** Define an experiment configuration
The experiment configuration is a hashmap containing all the information the GP
process needs to run. From the function and terminal sets it should use, to the
evaluation function to use, to how many threads it should run in.

*** Function set and terminal set
Starting off with the function and terminal sets:
#+BEGIN_SRC clojure
(def config-reg
     {
      ;; Some mathematical operators
      :function-set [(prim `- {:gp-type Number 
			       :gp-arg-types [Number Number]})

		     (prim `+ {:gp-type Number 
			       :gp-arg-types [Number Number]})

		     (prim `* {:gp-type Number 
			       :gp-arg-types [Number Number]})]

      ;; The two variables in the equation
      :terminal-set [(prim 'x {:gp-type Number})

		     (prim 'y {:gp-type Number})]

      ;; More to come...
      ... 
      })
#+END_SRC

We define two keys in the map: [[./config_reference.html#:function-set][:function-set]] and [[./config_reference.html#:terminal-set][:terminal-set]]. As the
[[./config_reference.html][Configuration Reference]] will tell you, both take a sequence of symbols. These
symbols will be available for use by the GP process in generating and breeding
expression trees. Besides the symbols themselves, we need to specify their type
information. For both functions and terminals, this includes what type of value
they return. For functions we also need to define a sequence of types that
defines what type each of their arguments should be.

This type information is stored in the symbol's metadata. ClojureGP provides the
helper =primitive=, which takes a symbol and a type info map, performs some
error checking, and stores the map as the symbol's metadata. In the above
example the abbreviation =prim= is used, because the type definitions can get
crowded.

Let's take a closer look at the =+= function symbol definition. The types are
straightforward: applying =+= will result in a number, so =:gp-type= should be
=Number=. It takes two arguments, the first of which should be a =Number=, and
the second of which should be a =Number=. Hence =:gp-arg-types= is the vector
=[Number Number]=. This data is stored in a map, which is attached to this =+=
symbol as metadata.

Besides the type information, the symbol itself has an important property. We
will be using Clojure's built-in =+=, that is, =clojure.core/+=. Because we
don't want to make any assumptions about the context in which the tree will be
evaluated (where ='+= might evaluate to =my.crazy/+=, or more realistically
where a custom function will simply not be defined), we prefix it with a
syntax-quote, or backquote. This tells Clojure's reader to resolve the symbol to
its namespace right here. For =`+=, this results in =clojure.core/+=, which is
exactly what we want.

You should resolve all symbols that will *not* be passed in as arguments by
backquoting them. This simple guideline will prevent all issues with symbols
resolving to the wrong thing. Or more likely, not resolving to anything: if we
define a function =foo= in our experiment namespace, and add it to our function
set as ='foo=, =eval= will not be able to resolve the symbol. As far as it knows
=foo= does not exist. Using =`foo=, will resolve it to =`my.ns/foo=, which tells
=eval= where to look and will prevent the issue.

The other two elements in the function set are similar, so we will move on to
the terminal set.

Much is the same there. We use =prim= to get a symbol with the right type data
attached. Both terminals, =x= and =y=, are of type =Number=. They are terminal
nodes of the tree, also known as "leaves" or a number of other terms. They will
not have arguments (child nodes in the tree), and we do not need to define types
for those.

We will pass =x= and =y= to our evolved functions as arguments when we evaluate
them, as we can see when we look back to our evaluation function. As per the
guideline given earlier, we should not resolve the symbols here, but leave them
as "clean" symbols, with a normal quote: ='x= and ='y=. In a moment we will
define our evolved functions' argument list to include these two symbols.

