doc/reg_example.html

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3">1.3</span> Define a type hierarchy </h3>
<div class="outline-text-3" id="text-1_3">

<p>At this point we would normally consider what types of values are playing a role
in the experiment, and use Clojure's ad hoc hierarchies with <code>derive</code> to create
an appropriate type hierarchy.
</p>
<p>
For this experiment however, we are evolving an equation, which only involves a
bunch of numbers. All function and terminal nodes will be of the same type,
which makes the experiment as a whole essentially untyped.
</p>
<p>
With some creativity we can still take a look at deriving type hierarchies:
</p>


<pre class="src src-clojure">(<span style="color: #AABBFF;">derive</span> <span style="color: #AABBFF;">::number</span> <span style="color: #AABBFF;">::any</span>)
(<span style="color: #AABBFF;">derive</span> <span style="color: #AABBFF;">::string</span> <span style="color: #AABBFF;">::any</span>)
(<span style="color: #AABBFF;">derive</span> <span style="color: #AABBFF;">Number</span> <span style="color: #AABBFF;">::number</span>)
</pre>



<p>
We pick <code>::any</code> as our root type here. This is arbitrary, as Clojure hierarchies
are very free-form, and let you use any keyword you want. We <code>derive</code> the
<code>::number</code> keyword from <code>::any</code>. This means we can define a function in our
experiment configuration's function set that requires an argument of type
<code>::any</code>, meaning the GP process can use any other node that has either the type
<code>::any</code>, or the type <code>::number</code>, because <code>(isa? ::number ::any)</code> is true.
</p>
<p>
Then we also derive <code>::string</code> from <code>::any</code>, meaning <code>(isa? ::string ::any)</code>
will be true, and for the hypothetical function mentioned just now any node of
type <code>::any</code>, <code>::number</code> or <code>::string</code> could be used.
</p>
<p>
Lastly we derive <code>Number</code>, that is the class <code>java.lang.Number</code>, from
<code>::any</code>. Java classes can (only) form the leaves in a Clojure hierarchy, and can
be used as types in ClojureGP experiments. Any Java subclasses will behave
properly, i.e. <code>(isa? Float Number)</code> is true, which is something you can also
employ in defining your types. In practice however, it's often nice to just
define a custom keyword hierarchy, as it is much easier to reorganise.
</p>
<p>
In this experiment, we will just define every type as being <code>Number</code>.
</p>
</div>

</div>

<div id="outline-container-1_4" class="outline-3">
<h3 id="sec-1_4"><span class="section-number-3">1.4</span> Define an experiment configuration </h3>
<div class="outline-text-3" id="text-1_4">

<p>The experiment configuration is a hashmap containing all the information the GP
process needs to run. From the function and terminal sets it should use, to the
evaluation function to use, to how many threads it should run in.
</p>

</div>

<div id="outline-container-1_4_1" class="outline-4">
<h4 id="sec-1_4_1"><span class="section-number-4">1.4.1</span> Function set and terminal set </h4>
<div class="outline-text-4" id="text-1_4_1">

<p>Starting off with the function and terminal sets:
</p>


<pre class="src src-clojure">(<span style="color: #4477FF; font-weight: bold;">def</span> <span style="color: #BB3344;">config-reg</span>
     {
      <span style="color: #119933; background-color: #132313;">;; </span><span style="color: #119933; background-color: #132313;">Some mathematical operators
</span>      <span style="color: #AABBFF;">:function-set</span> [(prim `- {<span style="color: #AABBFF;">:gp-type</span> <span style="color: #AABBFF;">Number</span> 
                   <span style="color: #AABBFF;">:gp-arg-types</span> [<span style="color: #AABBFF;">Number</span> <span style="color: #AABBFF;">Number</span>]})

             (prim `+ {<span style="color: #AABBFF;">:gp-type</span> <span style="color: #AABBFF;">Number</span> 
                   <span style="color: #AABBFF;">:gp-arg-types</span> [<span style="color: #AABBFF;">Number</span> <span style="color: #AABBFF;">Number</span>]})

             (prim `* {<span style="color: #AABBFF;">:gp-type</span> <span style="color: #AABBFF;">Number</span> 
                   <span style="color: #AABBFF;">:gp-arg-types</span> [<span style="color: #AABBFF;">Number</span> <span style="color: #AABBFF;">Number</span>]})]

      <span style="color: #119933; background-color: #132313;">;; </span><span style="color: #119933; background-color: #132313;">The two variables in the equation
</span>      <span style="color: #AABBFF;">:terminal-set</span> [(prim 'x {<span style="color: #AABBFF;">:gp-type</span> <span style="color: #AABBFF;">Number</span>})

             (prim 'y {<span style="color: #AABBFF;">:gp-type</span> <span style="color: #AABBFF;">Number</span>})]

      <span style="color: #119933; background-color: #132313;">;; </span><span style="color: #119933; background-color: #132313;">More to come...
</span>      ... 
      })
</pre>



<p>
We define two keys in the map: <a href="./config_reference.html#:function-set">:function-set</a> and <a href="./config_reference.html#:terminal-set">:terminal-set</a>. As the
<a href="./config_reference.html">Configuration Reference</a> will tell you, both take a sequence of symbols. These
symbols will be available for use by the GP process in generating and breeding
expression trees. Besides the symbols themselves, we need to specify their type
information. For both functions and terminals, this includes what type of value
they return. For functions we also need to define a sequence of types that
defines what type each of their arguments should be.
</p>
<p>
This type information is stored in the symbol's metadata. ClojureGP provides the
helper <code>primitive</code>, which takes a symbol and a type info map, performs some
error checking, and stores the map as the symbol's metadata. In the above
example the abbreviation <code>prim</code> is used, because the type definitions can get
crowded.
</p>
<p>
Let's take a closer look at the <code>+</code> function symbol definition. The types are
straightforward: applying <code>+</code> will result in a number, so <code>:gp-type</code> should be
<code>Number</code>. It takes two arguments, the first of which should be a <code>Number</code>, and
the second of which should be a <code>Number</code>. Hence <code>:gp-arg-types</code> is the vector
<code>[Number Number]</code>. This data is stored in a map, which is attached to this <code>+</code>
symbol as metadata.
</p>
<p>
Besides the type information, the symbol itself has an important property. We
will be using Clojure's built-in <code>+</code>, that is, <code>clojure.core/+</code>. Because we
don't want to make any assumptions about the context in which the tree will be
evaluated (where ='+= might evaluate to <code>my.crazy/+</code>, or more realistically
where a custom function will simply not be defined), we prefix it with a
syntax-quote, or backquote. This tells Clojure's reader to resolve the symbol to
its namespace right here. For <code>`+</code>, this results in <code>clojure.core/+</code>, which is
exactly what we want.
</p>
<p>
You should resolve all symbols that will <b>not</b> be passed in as arguments by
backquoting them. This simple guideline will prevent all issues with symbols
resolving to the wrong thing. Or more likely, not resolving to anything: if we
define a function <code>foo</code> in our experiment namespace, and add it to our function
set as ='foo=, <code>eval</code> will not be able to resolve the symbol. As far as it knows
<code>foo</code> does not exist. Using <code>`foo</code>, will resolve it to <code>`my.ns/foo</code>, which tells
<code>eval</code> where to look and will prevent the issue.
</p>
<p>
The other two elements in the function set are similar, so we will move on to
the terminal set.
</p>
<p>
Much is the same there. We use <code>prim</code> to get a symbol with the right type data
attached. Both terminals, <code>x</code> and <code>y</code>, are of type <code>Number</code>. They are terminal
nodes of the tree, also known as "leaves" or a number of other terms. They will
not have arguments (child nodes in the tree), and we do not need to define types
for those.
</p>
<p>
We will pass <code>x</code> and <code>y</code> to our evolved functions as arguments when we evaluate
them, as we can see when we look back to our evaluation function. As per the
guideline given earlier, we should not resolve the symbols here, but leave them
as "clean" symbols, with a normal quote: ='x= and ='y=. In a moment we will
define our evolved functions' argument list to include these two symbols.
</p>
</div>

</div>
