doc/src/reg_example.org
*** The other bits
With the function and terminal sets defined, most of our work is done. We only
need to define a few more things, and can let the rest fall back to defaults.

To start off with something easy: the [[./config_reference.html#:root-type][:root-type]] key should be set to the type
that the root of the tree should satisfy. In this case, that is simply =Number=.

As mentioned earlier, we need to specify that we want the argument list of
evolved functions to be =[x y]=. We can do this using the function template
functionality, by setting the [[./config_reference.html#:func-template-fn][:func-template-fn]] key with some help from
=cljgp.config/make-func-template=.

Next up, we specify the =evaluate-reg= function we defined earlier as the value
of [[./config_reference.html#:evaluation-fn][:evaluation-fn]], so that it will be used to generate fitness values for all
individuals during the evaluation phase.

#+BEGIN_SRC clojure
(def config-reg
     {
      ... ; snip

      ;; Evolved functions must return a number
      :root-type Number

      ;; Basic template for a fn with our arguments
      :func-template-fn (make-func-template '[x y])

      :evaluation-fn evaluate-reg

      ... ; snip
      })
#+END_SRC

Fairly straightforward. Take a look at the documentation for these keys linked
above if you're interested in the details.

The last few bits we will discuss here concern tree validation, the size of the
population, the number of threads and the RNG seeds.

First up is [[./config_reference.html#:validate-tree-fn][:validate-tree-fn]]. The function specified for that key will be used
to check every tree that is generated. If it returns false, the tree is scrapped
and a new one will be generated. This can be useful to prevent excessively large
trees, and that is what we will use it for here. We simply define an anonymous
function on the spot: =#(< (tree-depth %) 10)=. In other words: the depth of
the given tree must be smaller than 10 levels. The =tree-depth= function comes
from =cljgp.util=, which also has a =tree-size= function for example.

Next is the [[./config_reference.html#:population-size][:population-size]]. This value determines the number of individuals in
the population, as you would expect.

The value for [[./config_reference.html#:threads][:threads]] determines the number of threads used by ClojureGP to
split up the work over multiple cores. Check the linked documentation for more
detail.

Lastly, [[./config_reference.html#:rand-seeds][:rand-seeds]] should be a seq containing the seeds that will be used to
initialise the thread-local RNGs. Hence, there should be at least as many seeds
as there are threads. In =cljgp.config= a function is provided that creates a
lazy seq of seeds generated from the time, but here we will simply set two
arbitrary integers.

#+BEGIN_SRC clojure
(def config-reg
     {
      ... ; snip

      ;; Keep tree size sane
      :validate-tree-fn #(< (tree-depth %) 10)

      :population-size 128

      :threads 2

      :rand-seeds [9234 5327]
      })
#+END_SRC


*** Final configuration
This hard work results in the following configuration:

#+BEGIN_SRC clojure
(def config-reg
     {
      ;; Some mathematical operators
      :function-set [(prim `- {:gp-type Number 
			       :gp-arg-types [Number Number]})

		     (prim `+ {:gp-type Number 
			       :gp-arg-types [Number Number]})

		     (prim `* {:gp-type Number 
			       :gp-arg-types [Number Number]})]

      ;; The two variables in the equation
      :terminal-set [(prim 'x {:gp-type Number})

		     (prim 'y {:gp-type Number})]

      ;; Evolved functions must return a number
      :root-type Number

      ;; Basic template for a fn with our arguments
      :func-template-fn (make-func-template '[x y])

      :evaluation-fn evaluate-reg

      ;; Keep tree size sane
      :validate-tree-fn #(< (tree-depth %) 10)

      :population-size 128

      :threads 2

      :rand-seeds [9234 5327]
      })
#+END_SRC

Many settings were left on their defaults, such as the functions that will be
used to breed new individuals. When you generate a run from this configuration
using =generate-run=, it will tell you about the keys that fell back to
defaults, as we will see in a moment.

** Run the experiment
To finish off this tutorial we will define a =run= function so we can
conveniently run the experiment from the REPL when we want to, and we'll take a
look at the output it generates.

