doc/reg_example.html

<div id="outline-container-1_4_2" class="outline-4">
<h4 id="sec-1_4_2"><span class="section-number-4">1.4.2</span> The other bits </h4>
<div class="outline-text-4" id="text-1_4_2">

<p>With the function and terminal sets defined, most of our work is done. We only
need to define a few more things, and can let the rest fall back to defaults.
</p>
<p>
To start off with something easy: the <a href="./config_reference.html#:root-type">:root-type</a> key should be set to the type
that the root of the tree should satisfy. In this case, that is simply <code>Number</code>.
</p>
<p>
As mentioned earlier, we need to specify that we want the argument list of
evolved functions to be <code>[x y]</code>. We can do this using the function template
functionality, by setting the <a href="./config_reference.html#:func-template-fn">:func-template-fn</a> key with some help from
<code>cljgp.config/make-func-template</code>.
</p>
<p>
Next up, we specify the <code>evaluate-reg</code> function we defined earlier as the value
of <a href="./config_reference.html#:evaluation-fn">:evaluation-fn</a>, so that it will be used to generate fitness values for all
individuals during the evaluation phase.
</p>



<pre class="src src-clojure">(<span style="color: #4477FF; font-weight: bold;">def</span> <span style="color: #BB3344;">config-reg</span>
     {
      ... <span style="color: #119933; background-color: #132313;">; </span><span style="color: #119933; background-color: #132313;">snip
</span>
      <span style="color: #119933; background-color: #132313;">;; </span><span style="color: #119933; background-color: #132313;">Evolved functions must return a number
</span>      <span style="color: #AABBFF;">:root-type</span> <span style="color: #AABBFF;">Number</span>

      <span style="color: #119933; background-color: #132313;">;; </span><span style="color: #119933; background-color: #132313;">Basic template for a fn with our arguments
</span>      <span style="color: #AABBFF;">:func-template-fn</span> (make-func-template '[x y])

      <span style="color: #AABBFF;">:evaluation-fn</span> evaluate-reg

      ... <span style="color: #119933; background-color: #132313;">; </span><span style="color: #119933; background-color: #132313;">snip
</span>      })
</pre>



<p>
Fairly straightforward. Take a look at the documentation for these keys linked
above if you're interested in the details.
</p>
<p>
The last few bits we will discuss here concern tree validation, the size of the
population, the number of threads and the RNG seeds.
</p>
<p>
First up is <a href="./config_reference.html#:validate-tree-fn">:validate-tree-fn</a>. The function specified for that key will be used
to check every tree that is generated. If it returns false, the tree is scrapped
and a new one will be generated. This can be useful to prevent excessively large
trees, and that is what we will use it for here. We simply define an anonymous
function on the spot: <code>#(&lt; (tree-depth %) 10)</code>. In other words: the depth of
the given tree must be smaller than 10 levels. The <code>tree-depth</code> function comes
from <code>cljgp.util</code>, which also has a <code>tree-size</code> function for example.
</p>
<p>
Next is the <a href="./config_reference.html#:population-size">:population-size</a>. This value determines the number of individuals in
the population, as you would expect.
</p>
<p>
The value for <a href="./config_reference.html#:threads">:threads</a> determines the number of threads used by ClojureGP to
split up the work over multiple cores. Check the linked documentation for more
detail.
</p>
<p>
Lastly, <a href="./config_reference.html#:rand-seeds">:rand-seeds</a> should be a seq containing the seeds that will be used to
initialise the thread-local RNGs. Hence, there should be at least as many seeds
as there are threads. In <code>cljgp.config</code> a function is provided that creates a
lazy seq of seeds generated from the time, but here we will simply set two
arbitrary integers.
</p>



<pre class="src src-clojure">(<span style="color: #4477FF; font-weight: bold;">def</span> <span style="color: #BB3344;">config-reg</span>
     {
      ... <span style="color: #119933; background-color: #132313;">; </span><span style="color: #119933; background-color: #132313;">snip
</span>
      <span style="color: #119933; background-color: #132313;">;; </span><span style="color: #119933; background-color: #132313;">Keep tree size sane
</span>      <span style="color: #AABBFF;">:validate-tree-fn</span> #(<span style="color: #AABBFF;">&lt;</span> (tree-depth %) 10)

      <span style="color: #AABBFF;">:population-size</span> 128

      <span style="color: #AABBFF;">:threads</span> 2

      <span style="color: #AABBFF;">:rand-seeds</span> [9234 5327]
      })
</pre>




</div>

</div>

<div id="outline-container-1_4_3" class="outline-4">
<h4 id="sec-1_4_3"><span class="section-number-4">1.4.3</span> Final configuration </h4>
<div class="outline-text-4" id="text-1_4_3">

<p>This hard work results in the following configuration:
</p>



<pre class="src src-clojure">(<span style="color: #4477FF; font-weight: bold;">def</span> <span style="color: #BB3344;">config-reg</span>
     {
      <span style="color: #119933; background-color: #132313;">;; </span><span style="color: #119933; background-color: #132313;">Some mathematical operators
</span>      <span style="color: #AABBFF;">:function-set</span> [(prim `- {<span style="color: #AABBFF;">:gp-type</span> <span style="color: #AABBFF;">Number</span> 
                   <span style="color: #AABBFF;">:gp-arg-types</span> [<span style="color: #AABBFF;">Number</span> <span style="color: #AABBFF;">Number</span>]})

             (prim `+ {<span style="color: #AABBFF;">:gp-type</span> <span style="color: #AABBFF;">Number</span> 
                   <span style="color: #AABBFF;">:gp-arg-types</span> [<span style="color: #AABBFF;">Number</span> <span style="color: #AABBFF;">Number</span>]})

             (prim `* {<span style="color: #AABBFF;">:gp-type</span> <span style="color: #AABBFF;">Number</span> 
                   <span style="color: #AABBFF;">:gp-arg-types</span> [<span style="color: #AABBFF;">Number</span> <span style="color: #AABBFF;">Number</span>]})]

      <span style="color: #119933; background-color: #132313;">;; </span><span style="color: #119933; background-color: #132313;">The two variables in the equation
</span>      <span style="color: #AABBFF;">:terminal-set</span> [(prim 'x {<span style="color: #AABBFF;">:gp-type</span> <span style="color: #AABBFF;">Number</span>})

             (prim 'y {<span style="color: #AABBFF;">:gp-type</span> <span style="color: #AABBFF;">Number</span>})]

      <span style="color: #119933; background-color: #132313;">;; </span><span style="color: #119933; background-color: #132313;">Evolved functions must return a number
</span>      <span style="color: #AABBFF;">:root-type</span> <span style="color: #AABBFF;">Number</span>

      <span style="color: #119933; background-color: #132313;">;; </span><span style="color: #119933; background-color: #132313;">Basic template for a fn with our arguments
</span>      <span style="color: #AABBFF;">:func-template-fn</span> (make-func-template '[x y])

      <span style="color: #AABBFF;">:evaluation-fn</span> evaluate-reg

      <span style="color: #119933; background-color: #132313;">;; </span><span style="color: #119933; background-color: #132313;">Keep tree size sane
</span>      <span style="color: #AABBFF;">:validate-tree-fn</span> #(<span style="color: #AABBFF;">&lt;</span> (tree-depth %) 10)

      <span style="color: #AABBFF;">:population-size</span> 128

      <span style="color: #AABBFF;">:threads</span> 2

      <span style="color: #AABBFF;">:rand-seeds</span> [9234 5327]
      })
</pre>



<p>
Many settings were left on their defaults, such as the functions that will be
used to breed new individuals. When you generate a run from this configuration
using <code>generate-run</code>, it will tell you about the keys that fell back to
defaults, as we will see in a moment.
</p>
</div>
</div>

</div>

<div id="outline-container-1_5" class="outline-3">
<h3 id="sec-1_5"><span class="section-number-3">1.5</span> Run the experiment </h3>
<div class="outline-text-3" id="text-1_5">

<p>To finish off this tutorial we will define a <code>run</code> function so we can
conveniently run the experiment from the REPL when we want to, and we'll take a
look at the output it generates.
</p>

</div>
