doc/src/reg_example.org
*** Run function
If you have read the [[./overview.html][Overview]], you may recall that performing a GP run in ClojureGP entails
constructing a lazy seq of successive generations using =generate-run=, and then
consuming it until the last generation is reached, which is the one for which
the end condition has been reached[fn:end].

For this tutorial we are not really interested in advanced usage, so we will use
some of the functions provided by ClojureGP to handle this for us and give some
interesting information on the way:

#+BEGIN_SRC clojure
(defn run
  "Run experiment and print summary when done."
  []
  (reduce-to-summary
   (map print-stats
	(generate-run config-reg))))
#+END_SRC

Here =reduce-to-summary= consumes the sequence, tracking some statistics about
the run as a whole, and printing the best individual at the end along with the
stats. We also map =print-stats= over the sequence of generations, so that we
get fitness statistics of each generation immediately after it has been
generated. We leave out stuff like logging to a file for this example.

At this point we are done defining things, and we can try running the
experiment.

*** Performing a run
Personally, I find it convenient to simply run experiments in a REPL. It is
usually possible to use =clojure.core/load= to quickly and easily reload the
experiment after fixing some mistakes (or you could do it directly in the REPL,
just don't forget to apply the changes in the file as well if they work out). As
an example of performing a run, we will look at running the *reg-exp* example
experiment, which is virtually identical to the experiment we defined in this
tutorial.

From inside the *examples* directory, we run:
#+BEGIN_EXAMPLE
java -cp .;../src/;../lib/* clojure.main -i reg_exp.clj --repl
#+END_EXAMPLE

The ClojureGP source should be in *../src/* (relative to the examples
directory), and the required .jar packages (*clojure.jar* and
*clojure-contrib.jar* in this case) should be in *../lib/*.

Assuming this is true and we do not need to fight the JVM over classpaths, we
should get a REPL prompt with the *reg\_exp.clj* file already loaded. We can
then simply run the experiment as follows:

#+BEGIN_EXAMPLE
user=> (reg-exp/run)
Run configuration preprocessing report:
  NOTE: The following keys were missing, using default values:
     (:rand-fn-maker :pop-generation-fn :end-condition-fn :breeding-retries :selection-fn :breeders)

Gen 000: Best: 1.39 -- Worst: 58.17 -- Avg: 8.69
Gen 001: Best: 0.92 -- Worst: 15.10 -- Avg: 3.52
Gen 002: Best: 0.86 -- Worst: 14.50 -- Avg: 3.13
Gen 003: Best: 0.96 -- Worst: 6.99 -- Avg: 2.80
Gen 004: Best: 0.65 -- Worst: 5.92 -- Avg: 2.57
Gen 005: Best: 0.77 -- Worst: 13.61 -- Avg: 2.89
Gen 006: Best: 0.78 -- Worst: 10.03 -- Avg: 2.92
Gen 007: Best: 0.57 -- Worst: 9.57 -- Avg: 2.64
Gen 008: Best: 0.49 -- Worst: 8.34 -- Avg: 2.68
Gen 009: Best: 0.27 -- Worst: 16.35 -- Avg: 2.55
Gen 010: Best: 0.45 -- Worst: 8.90 -- Avg: 2.43
Gen 011: Best: 0.19 -- Worst: 16.71 -- Avg: 2.55
Gen 012: Best: 0.22 -- Worst: 15.57 -- Avg: 2.38
Gen 013: Best: 0.27 -- Worst: 8.46 -- Avg: 2.19
Gen 014: Best: 0.28 -- Worst: 7.33 -- Avg: 1.69
Gen 015: Best: 0.18 -- Worst: 13.83 -- Avg: 1.99
Gen 016: Best: 0.00 -- Worst: 9.96 -- Avg: 1.59

#################
  Run complete   
#################
Best individual of entire run:
Data of individual:
  Generation: 16
  Fitness: 3.1918912E-16
  Function:
(fn [x y] (* x (+ (+ (* x (* x x)) (* y (* y x))) y)))

Run statistics:
  Total time:      1954.50 msecs
  Inds. evaluated: 2176
#################

nil
user=> 
#+END_EXAMPLE

With our basic reporting setup, we only get some fitness data for each
generation. At the end of the run, the summary tells us a few things about the
best individual, and reports the time it took.

** In conclusion
In this tutorial we have taken all the basic steps that one needs to take in
order to run a ClojureGP experiment, discussing a lot of different points of
interest along the way.

A next step in learning about ClojureGP would be to look at the other included
examples, looking up any configuration keys that are unfamiliar in the
[[./config_reference.html][Reference]]. Of course, the rest of the documentation should also be of interest,
if you have not seen it yet. Lastly, you may be tempted to take a look at the
ClojureGP source to gain a deeper understanding. All functions are documented in
a (hopefully) useful manner.



[fn:end] We left the [[./config_reference.html#][:end-condition-fn]] at the default, which at the time of
writing is max. 100 generations or an individual with a fitness extremely close
to 0.
