doc/reg_example.html

<div id="outline-container-1_5_1" class="outline-4">
<h4 id="sec-1_5_1"><span class="section-number-4">1.5.1</span> Run function </h4>
<div class="outline-text-4" id="text-1_5_1">

<p>If you have read the <a href="./overview.html">Overview</a>, you may recall that performing a GP run in ClojureGP entails
constructing a lazy seq of successive generations using <code>generate-run</code>, and then
consuming it until the last generation is reached, which is the one for which
the end condition has been reached<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>.
</p>
<p>
For this tutorial we are not really interested in advanced usage, so we will use
some of the functions provided by ClojureGP to handle this for us and give some
interesting information on the way:
</p>



<pre class="src src-clojure">(<span style="color: #4477FF; font-weight: bold;">defn</span> <span style="color: #BB3344;">run</span>
  <span style="color: #AA44AA; background-color: #231323;">"Run experiment and print summary when done."</span>
  []
  (reduce-to-summary
   (<span style="color: #AABBFF;">map</span> print-stats
    (generate-run config-reg))))
</pre>



<p>
Here <code>reduce-to-summary</code> consumes the sequence, tracking some statistics about
the run as a whole, and printing the best individual at the end along with the
stats. We also map <code>print-stats</code> over the sequence of generations, so that we
get fitness statistics of each generation immediately after it has been
generated. We leave out stuff like logging to a file for this example.
</p>
<p>
At this point we are done defining things, and we can try running the
experiment.
</p>
</div>

</div>

<div id="outline-container-1_5_2" class="outline-4">
<h4 id="sec-1_5_2"><span class="section-number-4">1.5.2</span> Performing a run </h4>
<div class="outline-text-4" id="text-1_5_2">

<p>Personally, I find it convenient to simply run experiments in a REPL. It is
usually possible to use <code>clojure.core/load</code> to quickly and easily reload the
experiment after fixing some mistakes (or you could do it directly in the REPL,
just don't forget to apply the changes in the file as well if they work out). As
an example of performing a run, we will look at running the <b>reg-exp</b> example
experiment, which is virtually identical to the experiment we defined in this
tutorial.
</p>
<p>
From inside the <b>examples</b> directory, we run:
</p>


<pre class="example">java -cp .;../src/;../lib/* clojure.main -i reg_exp.clj --repl
</pre>



<p>
The ClojureGP source should be in <b>../src/</b> (relative to the examples
directory), and the required .jar packages (<b>clojure.jar</b> and
<b>clojure-contrib.jar</b> in this case) should be in <b>../lib/</b>.
</p>
<p>
Assuming this is true and we do not need to fight the JVM over classpaths, we
should get a REPL prompt with the <b>reg_exp.clj</b> file already loaded. We can
then simply run the experiment as follows:
</p>



<pre class="example">user=&gt; (reg-exp/run)
Run configuration preprocessing report:
  NOTE: The following keys were missing, using default values:
     (:rand-fn-maker :pop-generation-fn :end-condition-fn :breeding-retries :selection-fn :breeders)

Gen 000: Best: 1.39 -- Worst: 58.17 -- Avg: 8.69
Gen 001: Best: 0.92 -- Worst: 15.10 -- Avg: 3.52
Gen 002: Best: 0.86 -- Worst: 14.50 -- Avg: 3.13
Gen 003: Best: 0.96 -- Worst: 6.99 -- Avg: 2.80
Gen 004: Best: 0.65 -- Worst: 5.92 -- Avg: 2.57
Gen 005: Best: 0.77 -- Worst: 13.61 -- Avg: 2.89
Gen 006: Best: 0.78 -- Worst: 10.03 -- Avg: 2.92
Gen 007: Best: 0.57 -- Worst: 9.57 -- Avg: 2.64
Gen 008: Best: 0.49 -- Worst: 8.34 -- Avg: 2.68
Gen 009: Best: 0.27 -- Worst: 16.35 -- Avg: 2.55
Gen 010: Best: 0.45 -- Worst: 8.90 -- Avg: 2.43
Gen 011: Best: 0.19 -- Worst: 16.71 -- Avg: 2.55
Gen 012: Best: 0.22 -- Worst: 15.57 -- Avg: 2.38
Gen 013: Best: 0.27 -- Worst: 8.46 -- Avg: 2.19
Gen 014: Best: 0.28 -- Worst: 7.33 -- Avg: 1.69
Gen 015: Best: 0.18 -- Worst: 13.83 -- Avg: 1.99
Gen 016: Best: 0.00 -- Worst: 9.96 -- Avg: 1.59

#################
  Run complete   
#################
Best individual of entire run:
Data of individual:
  Generation: 16
  Fitness: 3.1918912E-16
  Function:
(fn [x y] (* x (+ (+ (* x (* x x)) (* y (* y x))) y)))

Run statistics:
  Total time:      1954.50 msecs
  Inds. evaluated: 2176
#################

nil
user=&gt; 
</pre>



<p>
With our basic reporting setup, we only get some fitness data for each
generation. At the end of the run, the summary tells us a few things about the
best individual, and reports the time it took.
</p>
</div>
</div>

</div>

<div id="outline-container-1_6" class="outline-3">
<h3 id="sec-1_6"><span class="section-number-3">1.6</span> In conclusion </h3>
<div class="outline-text-3" id="text-1_6">

<p>In this tutorial we have taken all the basic steps that one needs to take in
order to run a ClojureGP experiment, discussing a lot of different points of
interest along the way.
</p>
<p>
A next step in learning about ClojureGP would be to look at the other included
examples, looking up any configuration keys that are unfamiliar in the
<a href="./config_reference.html">Reference</a>. Of course, the rest of the documentation should also be of interest,
if you have not seen it yet. Lastly, you may be tempted to take a look at the
ClojureGP source to gain a deeper understanding. All functions are documented in
a (hopefully) useful manner.
</p>

</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> We left the <a href="./config_reference.html#">:end-condition-fn</a> at the default, which at the time of
writing is max. 100 generations or an individual with a fitness extremely close
to 0.
</p>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Stefan van der Meer
</p>
<p class="date"> Date: 2011-02-18 19:33:42 </p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
